const unicode = {
    'ृ' : '`',
    '!' : '!',
    '/' : '@',
    'रु' : '#',
    '$' : '$',
    'ः' : '%',
    '‘' : "^",
    '-' : '&',
    '’' : '*',
    ';' : '(',
    'द्ध' : ')',
    '.' : '-',
    'ऋ' : '_',
    'त्र' : '=',
    '़' : '+',
    'ु' : 'q',
    'ू' : 'w',
    'म' : 'e',
    'त' : 'r',
    'ज' : 't',
    'ल' : 'y',
    'न' : 'u',
    'प' : 'i',
    'व' : 'o',
    'च' : 'p',
    'ख्' : '[',
    ',' : ']',
    '?' : '\\',
    'ं' : 'a',
    'े' : 's',
    'क' : 'd',
    'ि' : 'f',
    'ह' : 'g',
    'ी' : 'h',
    'र' : 'j',
    'ा' : 'k',
    'स' : 'l',
    'य' : ';',
    'श्' : "'",
    '्र' : 'z',
    'ग' : 'x',
    'ब' : 'c',
    'अ' : 'v',
    'इ' : 'b',
    'द' : 'n',
    'उ' : 'm',
    'ए' : ',',
    'ण्' : '.',
    'ध्' : '/',
    // Using shift
    'फ' : 'Q',
    'ॅ' : 'W',
    'म्' : 'E',
    'त्' : 'R',
    'ज्' : 'T',
    'ल्' : 'Y',
    'न्' : 'U',
    'प्' : 'I',
    'व्' : 'O',
    'च्' : 'P',
    'क्ष्' : '{',
    'द्व' : '}',
    'द्य' : '|',
    '।' : 'A',
    'ै' : 'S',
    'क्' : 'D',
    'थ्' : 'F',
    'ळ' : 'G',
    'भ्' : 'H',
    'श्र' : 'J',
    'ज्ञ' : 'K',
    'स्' : 'L',
    'रू' : ':',
    'ष्' : '"',
    'Z' : 'Z',
    'ग्' : 'X',
    'ब्' : 'C',
    'ट' : 'V',
    'ठ' : 'B',
    'छ' : 'N',
    'ड' : 'M',
    'ढ' : '<',
    'झ' : '>',
    'घ्' : '?',
    // Extra added
    'ख' : '[k',
    'श' : "'k",
    'आ' : 'vk',
    'फ़' : 'Q',

}

const getKruti = (string)=>{
    let result = '';
    if (string[0] in unicode){
        for (let i of string){
            if (unicode[i] !== undefined){
                result += unicode[i]
            }else{
                result += ' ';
            }
        }
        return result;
    }else{
        return false
    }
}

export {getKruti,unicode}